

"""
REMOVE DUPLICATES FROM SORTED ARRAY
(26. Remove Duplicates from Sorted Array)

Задача:
Дано відсортований у неспадному порядку масив цілих чисел nums.
Потрібно видалити дублікати "на місці" (in-place) так, щоб кожен
унікальний елемент з’являвся лише один раз.

Повернути кількість унікальних елементів k.
Перші k елементів масиву nums повинні містити унікальні значення.
Елементи після k можна ігнорувати.

Приклад:
nums = [1, 1, 2, 2, 3]
Результат:
k = 3
nums = [1, 2, 3, ...]

Ідея:
Оскільки масив відсортований, дублікати стоять поруч.
Використовуємо підхід "двох вказівників":

i — проходить по масиву
k — позиція для запису наступного унікального елемента

Алгоритм:
1. Перший елемент завжди унікальний → k = 1
2. Проходимо масив з другого елемента
3. Якщо nums[i] != nums[i - 1]:
      nums[k] = nums[i]
      k += 1
4. Повертаємо k

Складність:
Time: O(n)
Space: O(1)
"""


def removeDuplicates(nums):
    if not nums:
        return 0

    k = 1

    for i in range(1, len(nums)):
        if nums[i] != nums[i - 1]:
            nums[k] = nums[i]
            k += 1

    return k



"""
(122. Best Time to Buy and Sell Stock II)
Дано масив цілих чисел prices, де prices[i] — це ціна акції в i-й день.

Кожного дня ви можете вирішити купити і/або продати акцію.
При цьому:
ви можете володіти не більше ніж однією акцією одночасно
можна купувати й продавати акцію багато разів
дозволяється продати і знову купити в той самий день, якщо ви не володієте більше ніж однією акцією

Потрібно знайти і повернути максимальний прибуток, який можна отримати.

Приклад 1
Input: prices = [7,1,5,3,6,4]
Output: 7

Приклад 2
Input: prices = [1,2,3,4,5]
Output: 4

Приклад 3
Input: prices = [7,6,4,3,1]
Output: 0

Як це працює
Приклад:
prices = [7,1,5,3,6,4]
Різниці між днями:
1 - 7 = -6
5 - 1 = +4
3 - 5 = -2
6 - 3 = +3
4 - 6 = -2
Беремо лише позитивні:
4+3=7
"""

class Solution:
    def maxProfit(self, prices: List[int]) -> int:
        profit = 0

        for i in range(1, len(prices)):
            if prices[i] > prices[i - 1]:
                profit += prices[i] - prices[i - 1]

        return profit
            








